Revit 2027 API
DividedSurface.GetGridNodeReference Method
Get a reference to the geometric point associated with a grid node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetGridNodeReference(
	GridNode gridNode
)
Public Function GetGridNodeReference (
	gridNode As GridNode
) As Reference
public:
Reference^ GetGridNodeReference(
	GridNode gridNode
)
member GetGridNodeReference :
        gridNode : GridNode -> Reference
Parameters
gridNode GridNode
Return Value
Reference
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace